// ให้เขียนโค้ดเพื่อหาผลรวมของเลขโดด  
//     - รับค่าตัวเลขจากผู้ใช้งาน  
//     - แสดงผลลัพธ์เป็นผลรวมของเลขแต่ละหลัก

// <!-- 4596 === 4+5+9+6 -->


// 4569 % 10  => 9   // (4659 - 9) / 10  => 456
// 456 % 10 => 6     // (456 -6) / 10 => 45
// 45 % 10 => 5      // (456 -6) / 10 => 4
// 4 % 10 => 4       // (456 -6) / 10 => 0
// 4596 === 4+5+9+6 === 24 === sum

// ( 4659 - (4569 % 10) ) / 10 => 456
// ( n - (n % 10) ) / 10
// So,
// new_n = ( n - (digit) ) / 10 ;


let n = +prompt('Enter number : ');
let sum = 0;

while (n) {
    let digit = n % 10;
    n = ( n - (digit) ) / 10 ;
    sum += digit
}
console.log(sum)